Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 256, 64, 1)]      0         
_________________________________________________________________
reshape (Reshape)            (None, 128, 32, 4)        0         
_________________________________________________________________
conv2d (Conv2D)              (None, 128, 16, 16)       592       
_________________________________________________________________
p_re_lu (PReLU)              (None, 128, 16, 16)       16        
_________________________________________________________________
batch_normalization (BatchNo (None, 128, 16, 16)       112       
_________________________________________________________________
full_gated_conv2d (FullGated (None, 128, 16, 16)       4640      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 128, 16, 32)       4640      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 128, 16, 32)       32        
_________________________________________________________________
batch_normalization_1 (Batch (None, 128, 16, 32)       224       
_________________________________________________________________
full_gated_conv2d_1 (FullGat (None, 128, 16, 32)       18496     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 64, 4, 40)         10280     
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 64, 4, 40)         40        
_________________________________________________________________
batch_normalization_2 (Batch (None, 64, 4, 40)         280       
_________________________________________________________________
full_gated_conv2d_2 (FullGat (None, 64, 4, 40)         28880     
_________________________________________________________________
dropout (Dropout)            (None, 64, 4, 40)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 4, 48)         17328     
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 64, 4, 48)         48        
_________________________________________________________________
batch_normalization_3 (Batch (None, 64, 4, 48)         336       
_________________________________________________________________
full_gated_conv2d_3 (FullGat (None, 64, 4, 48)         41568     
_________________________________________________________________
dropout_1 (Dropout)          (None, 64, 4, 48)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 1, 56)         21560     
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 32, 1, 56)         56        
_________________________________________________________________
batch_normalization_4 (Batch (None, 32, 1, 56)         392       
_________________________________________________________________
full_gated_conv2d_4 (FullGat (None, 32, 1, 56)         56560     
_________________________________________________________________
dropout_2 (Dropout)          (None, 32, 1, 56)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 32, 1, 64)         32320     
_________________________________________________________________
p_re_lu_5 (PReLU)            (None, 32, 1, 64)         64        
_________________________________________________________________
batch_normalization_5 (Batch (None, 32, 1, 64)         448       
_________________________________________________________________
reshape_1 (Reshape)          (None, 32, 64)            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 32, 256)           148992    
_________________________________________________________________
dense (Dense)                (None, 32, 256)           65792     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 32, 256)           296448    
_________________________________________________________________
dense_1 (Dense)              (None, 32, 98)            25186     
=================================================================
Total params: 775,330
Trainable params: 774,050
Non-trainable params: 1,280
_________________________________________________________________
